Revit 2027 API
CriticalPathCollector.ToNetworkSegmentIds Method
 Returns the list of analytical segment ids on the network critical path.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<MEPNetworkSegmentId> ToNetworkSegmentIds()
Public Function ToNetworkSegmentIds As IList(Of MEPNetworkSegmentId)
public:
IList<MEPNetworkSegmentId^>^ ToNetworkSegmentIds()
member ToNetworkSegmentIds : unit -> IList<MEPNetworkSegmentId>
Return Value
IList<MEPNetworkSegmentId>
 The array of all analytical segment ids on the critical path.
See Also
Reference
CriticalPathCollector Class
Autodesk.Revit.DB.Analysis Namespace